TONYHUaNGggggg/Stm32_Balanced_Car/User/upstandingcar.c
#include "upstandingcar.h"
#include "I2C_MPU6050.h"
#include "MOTOR.h"
#include "led.h"
#include "USART.H"
#include "MPU6050.H"
#include "UltrasonicWave.h"
#include "stm32f10x_gpio.h"
#include "math.h" 
#include <string.h>
#include <stdlib.h>
#include <stdio.h>
#include "adc.h"



enum{
  enSTOP = 0,
  enRUN,
  enBACK,
  enLEFT,
  enRIGHT,
  enTLEFT,
  enTRIGHT
}enCarState;


int g_newcarstate = enSTOP; 
static u32 BST_u32EightTick = 0;
static u8 BST_u8MainEventLast = 0;

typedef enum {
	enAutoRunStraight = 0,
	enAutoRunFigureEight,
	enAutoRunFixed,
	enAutoRunTask
} enAutoRunMode;

typedef struct {
	float fBaseSpeedCmd;
	float fTurnAmplCmd;
	float fOmegaRad;
	float fStartPhaseRad;
	float fSpeedModRatio;
} stFigureEightParam;

typedef enum {
	enMotionTaskIdle = 0,
	enMotionTaskStraight,
	enMotionTaskArc,
	enMotionTaskTurn,
	enMotionTaskSpin
} enMotionTaskType;

typedef struct {
	enMotionTaskType enType;
	float fTargetSpeedCmd;
	float fTargetTurnCmd;
	float fCurrentSpeedCmd;
	float fAccelStepPerTick;
	u16 u16DurationTick;
	u16 u16ElapsedTick;
	u8 u8Active;
} stMotionTask;

static enAutoRunMode g_enAutoRunMode = enAutoRunStraight;
static stFigureEightParam g_stFigureEightParam = {
	EIGHT_DEFAULT_BASE_SPEED_CMD,
	EIGHT_DEFAULT_TURN_AMPL_CMD,
	EIGHT_DEFAULT_OMEGA_RAD,
	EIGHT_DEFAULT_START_PHASE_RAD,
	EIGHT_DEFAULT_SPEED_MOD_RATIO
};
static float g_fStraightSpeedCmd = STRAIGHT_DEFAULT_SPEED_CMD;
static float g_fFixedSpeedCmd = FIXED_SPEED_CMD;
static float g_fFixedTurnCmd = FIXED_TURN_CMD;
static float g_fObsRightAvoidSpeedCmd = ULTRA_OBS_RIGHT_AVOID_SPEED_CMD;
static float g_fObsRightAvoidTurnCmd = ULTRA_OBS_RIGHT_AVOID_TURN_CMD;
static stMotionTask g_stMotionTask = {
	enMotionTaskIdle,
	0.0f,
	0.0f,
	0.0f,
	MOTION_DEFAULT_ACCEL_STEP,
	MOTION_TASK_DURATION_MIN_TICK,
	0,
	0
};
static u16 g_u16EightArcDurationTick = EIGHT_ARC_DURATION_TICK;
static float g_fEightArcAccelStep = EIGHT_ARC_ACCEL_STEP;
static u8 g_u8EightArcStartRight = EIGHT_ARC_START_RIGHT;
static u8 g_u8EightArcIndex = 0;
static u8 g_u8TaskStraightObsEnable = 0;
static u8 g_u8ObsConfirmCnt = 0;
static u8 g_u8ObsStopConfirmCnt = 0;
static u8 BST_u8StraightEventLast = 0;
static float g_fWheelBalanceI = 0.0f;
static float g_fWheelBalanceOut = 0.0f;


char manydisplay[80] ={0};
char updata[80] ={0};




u8 BST_u8MainEventCount;						  
u8 BST_u8SpeedControlCount;						  
u8 BST_u8SpeedControlPeriod;
u8 BST_u8DirectionControlPeriod;
u8 BST_u8DirectionControlCount;					  
u8 BST_u8trig;
u8 ucBluetoothValue;                      
float volt = 12.0;




float BST_fSpeedControlOut;						   
float BST_fSpeedControlOutOld;
float BST_fSpeedControlOutNew;
float BST_fAngleRef;
float BST_fAngleControlOut;
float BST_fLeftMotorOut;
float BST_fRightMotorOut;

float BST_fCarAngle;						 
float gyro_z;
float gyrx;
float gy0;


float  BST_fCarAngle_P = 210.0;
float  BST_fCarAngle_D = 0.35;

float  BST_fCarSpeed_P = 4.5;
float  BST_fCarSpeed_I = 0.12;

const double PID_Original[4] ={170.0, 0.24, 4.5, 0.12}; 
char  alldata[80];
char *iap;


s16   BST_s16LeftMotorPulse;					  
s16	  BST_s16RightMotorPulse;					   

s32   BST_s32LeftMotorPulseOld;
s32   BST_s32RightMotorPulseOld;
s32   BST_s32LeftMotorPulseSigma;				  
s32   BST_s32RightMotorPulseSigma;				 

float BST_fCarSpeed;							 
float BST_fCarSpeedOld;

float BST_fCarPosition;						   


int leftstop=0;
int rightstop=0;
int stopflag=0;



float fchaoshengbo = 0;							   
float juli = 0;									 

																	
float BST_fBluetoothSpeed;						
float BST_fBluetoothDirectionNew;			    
float BST_fBluetoothDirectionSL;			    
float BST_fBluetoothDirectionSR;			   
int chaoflag=0;
int x,y1,z1,y2,z2,flagbt;
int g_autoup = 0;
int g_uptimes = 5000;  
char charkp[10],charkd[10],charksp[10],charksi[10];
char lspeed[10],rspeed[10],daccel[10],dgyro[10],csb[10],vi[10];
char kp,kd,ksp,ksi;
float dac = 0,dgy = 0;



float BST_fBluetoothDirectionL;				   
float BST_fBluetoothDirectionR;				   
int driectionxco=800;



		
float  Q_angle=0.001;  
float  Q_gyro=0.003;
float  R_angle=0.5;
float  dt=0.005;	                  
char   C_0 = 1;
float  Q_bias, Angle_err;
float  PCt_0=0, PCt_1=0, E=0;
float  K_0=0, K_1=0, t_0=0, t_1=0;
float  Pdot[4] ={0,0,0,0};
float  PP[2][2] = { { 1, 0 },{ 0, 1 } };


void SendAutoUp(void);
static void FigureEightControl(void);
static void StraightAvoidControl(void);
static void MotionTaskControl(void);
static float MotionClampFloat(float fValue, float fMin, float fMax);
static void MotionTaskStartInternal(enMotionTaskType enType, float fSpeedCmd, float fTurnCmd, float fAccelStep, u16 u16DurationTick, u8 u8EnterTaskMode);
static u8 MotionTaskRunStep(u8 u8DeltaTick, float *pfSpeedCmd, float *pfTurnCmd);
static void MotionApplyObstacleAvoid(float *pfSpeedCmd, float *pfDirectionCmd);


void delay_nms(u16 time)
{    
   u16 i=0;  
   while(time--)
   {
      i=12000;  
      while(i--) ;    
   }
}




void CarUpstandInit(void)
{
	
	
	BST_s16LeftMotorPulse = BST_s16RightMotorPulse = 0;					  
	BST_s32LeftMotorPulseSigma = BST_s32RightMotorPulseSigma = 0;		  

	BST_fCarSpeed = BST_fCarSpeedOld = 0;								   
	BST_fCarPosition = 0;												  
	BST_fCarAngle    = 0;												  
	BST_fAngleRef    = 0;

	BST_fAngleControlOut = BST_fSpeedControlOut = BST_fBluetoothDirectionNew = 0;	
	BST_fLeftMotorOut    = BST_fRightMotorOut   = 0;								
	BST_fBluetoothSpeed  = 0;														
	BST_fBluetoothDirectionL =BST_fBluetoothDirectionR= 0;						    
	BST_fBluetoothDirectionSL =BST_fBluetoothDirectionSR= 0;						
	
    BST_u8MainEventCount=0;															
	BST_u8SpeedControlCount=0;														
    BST_u8SpeedControlPeriod=0;														
	BST_u8MainEventLast=BST_u8MainEventCount;
	BST_u32EightTick=0;
	BST_u8StraightEventLast=BST_u8MainEventCount;
	g_u16EightArcDurationTick = EIGHT_ARC_DURATION_TICK;
	g_fEightArcAccelStep = EIGHT_ARC_ACCEL_STEP;
	g_u8EightArcStartRight = EIGHT_ARC_START_RIGHT;
	g_u8EightArcIndex = 0;
	g_u8TaskStraightObsEnable = 0;
	g_fWheelBalanceI = 0.0f;
	g_fWheelBalanceOut = 0.0f;
	AutoRun_SetStraight(STRAIGHT_DEFAULT_SPEED_CMD);

