TONYHUaNGggggg/Stm32_Balanced_Car/User/upstandingcar.c
	fchaoshengbo=0;											
  
	

}

void ResetPID()
{	
	if(BST_fCarAngle_P != PID_Original[0])
	{
		BST_fCarAngle_P = PID_Original[0];
	}
	if(BST_fCarAngle_D != PID_Original[1])
	{
		BST_fCarAngle_D = PID_Original[1];
	}
	if(BST_fCarSpeed_P != PID_Original[2])
	{
		BST_fCarSpeed_P = PID_Original[2];
	}
	if(BST_fCarSpeed_I != PID_Original[3])
	{
		BST_fCarSpeed_I = PID_Original[3];
	}
	g_fWheelBalanceI = 0.0f;
	g_fWheelBalanceOut = 0.0f;

}	


void AngleControl(void)	 
{
	if(flagbt==1)
	{
		BST_fCarAngle_P=0;
		BST_fCarAngle_P=y1*1.71875;
	}
		if(flagbt==2)
	{
		BST_fCarAngle_D=0;
		BST_fCarAngle_D=(z1-64)*0.15625;
	}
	dac=accel[2];
	dgy=gyro[2];
	if(Pitch==0||Pitch<-20||Pitch>20)			  
	{
		  
	  GPIO_ResetBits(GPIOC, GPIO_Pin_13); 		 
	}
	else 
	{GPIO_SetBits(GPIOC, GPIO_Pin_13);}			 
	
	BST_fCarAngle = Roll - CAR_ZERO_ANGLE;													   
	BST_fAngleControlOut = (BST_fCarAngle - BST_fAngleRef) * BST_fCarAngle_P + gyro[0] * BST_fCarAngle_D;
}


void SetMotorVoltageAndDirection(s16 s16LeftVoltage,s16 s16RightVoltage)
{
	  u16 u16LeftMotorValue;
	  u16 u16RightMotorValue;
	
    if(s16LeftVoltage<0)										 
    {	
	    GPIO_SetBits(GPIOB, GPIO_Pin_14 );				    
      GPIO_ResetBits(GPIOB, GPIO_Pin_15 );
      s16LeftVoltage = (-s16LeftVoltage);
    }
    else 
    {	
      GPIO_SetBits(GPIOB, GPIO_Pin_15 );				    	 
      GPIO_ResetBits(GPIOB, GPIO_Pin_14 ); 
      s16LeftVoltage = s16LeftVoltage;
    }

    if(s16RightVoltage<0)
    {															 
      GPIO_SetBits(GPIOB, GPIO_Pin_13 );				    
      GPIO_ResetBits(GPIOB, GPIO_Pin_12 );
      s16RightVoltage = (-s16RightVoltage);
    }
    else														
    {
	    GPIO_SetBits(GPIOB, GPIO_Pin_12 );				    
      GPIO_ResetBits(GPIOB, GPIO_Pin_13 );	
     
      s16RightVoltage = s16RightVoltage;
    }
		
	   u16RightMotorValue= (u16)s16RightVoltage;
	   u16LeftMotorValue = (u16)s16LeftVoltage;


	TIM_SetCompare3(TIM2,u16LeftMotorValue);			  
	TIM_SetCompare4(TIM2,u16RightMotorValue);			  

#if 1	 
		
  if(Pitch>10||Pitch<-10&BST_fBluetoothDirectionSR==0&BST_fBluetoothDirectionSL==0)
	{		
		TIM_SetCompare3(TIM2,0);
		TIM_SetCompare4(TIM2,0);
		stopflag=1;		
	}
	else stopflag=0;
	
	if(BST_fCarAngle > 50 || BST_fCarAngle < (-50))
	{
		TIM_SetCompare3(TIM2,0);
		TIM_SetCompare4(TIM2,0);  
		stopflag=1;	
	}
	else stopflag=0;

#endif
}


void MotorOutput(void)																					  
{	   
	float fDirectionCmd;
	float fLeftBaseBias;
	float fRightBaseBias;
			
	fDirectionCmd = BST_fBluetoothDirectionNew;
#if WHEEL_BALANCE_ENABLE
	fDirectionCmd += g_fWheelBalanceOut;
#endif

	fLeftBaseBias = 0.0f;
	fRightBaseBias = 0.0f;
#if WHEEL_BASE_BIAS_ENABLE
	if(stopflag == 0
		&& fabsf(BST_fBluetoothSpeed) >= WHEEL_BASE_BIAS_ACTIVE_SPEED_CMD
		&& fabsf(BST_fBluetoothDirectionNew) <= WHEEL_BASE_BIAS_STRAIGHT_DIR_MAX)
	{
		fLeftBaseBias = WHEEL_LEFT_BASE_BIAS;
		fRightBaseBias = WHEEL_RIGHT_BASE_BIAS;
	}
#endif

	BST_fLeftMotorOut  = BST_fAngleControlOut + fDirectionCmd + fLeftBaseBias;
    BST_fRightMotorOut = BST_fAngleControlOut - fDirectionCmd + fRightBaseBias;

		
	if((s16)BST_fLeftMotorOut  > MOTOR_OUT_MAX)	BST_fLeftMotorOut  = MOTOR_OUT_MAX;
	if((s16)BST_fLeftMotorOut  < MOTOR_OUT_MIN)	BST_fLeftMotorOut  = MOTOR_OUT_MIN;
	if((s16)BST_fRightMotorOut > MOTOR_OUT_MAX)	BST_fRightMotorOut = MOTOR_OUT_MAX;
	if((s16)BST_fRightMotorOut < MOTOR_OUT_MIN)	BST_fRightMotorOut = MOTOR_OUT_MIN;
	
    SetMotorVoltageAndDirection((s16)BST_fLeftMotorOut,(s16)BST_fRightMotorOut);
    
}

void GetMotorPulse(void)              
{ 
	
	uint16_t u16TempLeft;
	uint16_t u16TempRight;
	
	u16TempLeft = TIM_GetCounter(TIM3);   
 	u16TempRight= TIM_GetCounter(TIM4);	
	leftstop=u16TempLeft;
	rightstop=u16TempRight;
	TIM_SetCounter(TIM3,0);
	TIM_SetCounter(TIM4,0);
	BST_s16LeftMotorPulse=u16TempLeft;
	BST_s16RightMotorPulse=(-u16TempRight);
		
	BST_s32LeftMotorPulseSigma  +=BST_s16LeftMotorPulse;		 
	BST_s32RightMotorPulseSigma +=BST_s16RightMotorPulse; 	 
}


void SpeedControl(void)
{
  float fPulseDiff;
  
 
	BST_fCarSpeed = (BST_s32LeftMotorPulseSigma  + BST_s32RightMotorPulseSigma );
	fPulseDiff = (float)(BST_s32RightMotorPulseSigma - BST_s32LeftMotorPulseSigma);
	if(fPulseDiff > -WHEEL_BALANCE_ERR_DEADBAND && fPulseDiff < WHEEL_BALANCE_ERR_DEADBAND)
	{
		fPulseDiff = 0.0f;
	}
	BST_s32LeftMotorPulseSigma =BST_s32RightMotorPulseSigma = 0;	  
	BST_fCarSpeedOld *= 0.7;
	BST_fCarSpeedOld +=BST_fCarSpeed*0.3;
	
	BST_fCarPosition += BST_fCarSpeedOld; 		 
	BST_fCarPosition += BST_fBluetoothSpeed;   
	BST_fCarPosition +=	fchaoshengbo;		   
	if(stopflag==1)
	{
		BST_fCarPosition=0;
		
	}
	

	
	if((s32)BST_fCarPosition > CAR_POSITION_MAX)    BST_fCarPosition = CAR_POSITION_MAX;
	if((s32)BST_fCarPosition < CAR_POSITION_MIN)    BST_fCarPosition = CAR_POSITION_MIN;
	
		if(flagbt==3)
	{
		BST_fCarSpeed_P=0;
		BST_fCarSpeed_P=(y2-128)*0.46875;
	}
		if(flagbt==4)
	{
		BST_fCarSpeed_I=0;
		BST_fCarSpeed_I=(z2-192)*0.15625;
	}
	

																								  
	BST_fSpeedControlOutNew = (BST_fCarSpeedOld -CAR_SPEED_SET ) * BST_fCarSpeed_P + (BST_fCarPosition - CAR_POSITION_SET ) * BST_fCarSpeed_I; 

	if(BST_fCarAngle_P > 0.001f || BST_fCarAngle_P < -0.001f)
	{
		BST_fAngleRef = -BST_fSpeedControlOutNew / BST_fCarAngle_P;
	}
	else
	{
		BST_fAngleRef = 0;
	}

	if(BST_fAngleRef > CAR_ANGLE_REF_MAX) BST_fAngleRef = CAR_ANGLE_REF_MAX;
	if(BST_fAngleRef < CAR_ANGLE_REF_MIN) BST_fAngleRef = CAR_ANGLE_REF_MIN;

#if WHEEL_BALANCE_ENABLE
	if(stopflag == 0 && fabsf(BST_fBluetoothSpeed) >= WHEEL_BALANCE_ACTIVE_SPEED_CMD)
	{
		if(fPulseDiff == 0.0f)
		{
			g_fWheelBalanceI *= 0.98f;
		}
		else
		{
			g_fWheelBalanceI += fPulseDiff * WHEEL_BALANCE_KI;
		}
		if(g_fWheelBalanceI > WHEEL_BALANCE_I_LIMIT) g_fWheelBalanceI = WHEEL_BALANCE_I_LIMIT;
		if(g_fWheelBalanceI < -WHEEL_BALANCE_I_LIMIT) g_fWheelBalanceI = -WHEEL_BALANCE_I_LIMIT;

		g_fWheelBalanceOut = fPulseDiff * WHEEL_BALANCE_KP + g_fWheelBalanceI;
		if(g_fWheelBalanceOut > WHEEL_BALANCE_OUT_LIMIT) g_fWheelBalanceOut = WHEEL_BALANCE_OUT_LIMIT;
		if(g_fWheelBalanceOut < -WHEEL_BALANCE_OUT_LIMIT) g_fWheelBalanceOut = -WHEEL_BALANCE_OUT_LIMIT;
	}
	else
	{
		g_fWheelBalanceI *= 0.8f;
		g_fWheelBalanceOut *= 0.8f;
	}
#endif

