TONYHUaNGggggg/Stm32_Balanced_Car/User/upstandingcar.c
}






void chaoshengbo(void)
{  
	if(chaoflag==0)
	{
	
      	juli=TIM_GetCounter(TIM1)*5*34/200.0;
		printf("juli=%f\n",juli);
		if(g_enAutoRunMode == enAutoRunStraight)
		{
			fchaoshengbo = 0;
			return;
		}
		
	    if(juli <= 4.00)								  
		{
	    	fchaoshengbo= (-300);
	    }
		else if(juli >= 5 & juli <= 8)
		{
			fchaoshengbo=500;
		}
	    else 
		{
			fchaoshengbo=0;						 
 	    }
  	}
	
	
	
    
 }


void CalcUpData()
{
	float ls, rs, sLence;
	short s_Acc, s_Gyro;
	u16 ad_value;

	
	if(g_autoup == 1)
	{
		
		ls = BST_fLeftMotorOut;
		rs = BST_fRightMotorOut;
		s_Acc = accel[1];
		s_Gyro = gyro[0];
		sLence = juli;
		
		
		dac=(s_Acc/16384.0f)*9.8f;
		dgy=((s_Gyro-128.1f)/131.0f);
		
		ls=ls/3.91;
		rs=rs/3.91;
	
		memset(manydisplay, 0x00, 80);
		memcpy(manydisplay, "$LV", 4);
	
		memset(lspeed, 0x00, sizeof(lspeed));
		memset(rspeed, 0x00, sizeof(rspeed));
		memset(daccel, 0x00, sizeof(daccel));
		memset(dgyro, 0x00, sizeof(dgyro));
		memset(csb, 0x00, sizeof(csb));
		memset(vi, 0x00, sizeof(vi));
	
		if((ls <= 1000) && (ls >= -1000))
			sprintf(lspeed,"%3.2f",ls);
		else
		{
			
			
			return;
		}
			
		
		if((rs <= 1000) && (rs >= -1000))
			sprintf(rspeed,"%3.2f",rs);
		else
		{
			
			
			return;
		}
		
		if((dac > -20) && (dac < 20))
			sprintf(daccel,"%3.2f",dac);
		else
		{
			
			
			return;
		}
		
		if((dgy > -3000) && (dgy < 3000))
			sprintf(dgyro,"%3.2f",dgy);
		else
		{
			
			
			return;
		}
	
		if((sLence >= 0) && (sLence < 10000))
			sprintf(csb,"%3.2f",sLence);
		else
		{
			
			
			return;
		}
		
		ad_value = Get_Adc(0);
		volt = 13.3f*ad_value/4096.0f-0.2f;
		if((volt >= 0) && (volt < 20))
			sprintf(vi,"%3.2f",volt);
		else
		{
			
			
			return;
		}
	
		strcat(manydisplay,lspeed);
		strcat(manydisplay,",RV");
		strcat(manydisplay,rspeed);
		strcat(manydisplay,",AC");
		strcat(manydisplay,daccel);
		strcat(manydisplay,",GY");
		strcat(manydisplay,dgyro);
		strcat(manydisplay,",CSB");
		strcat(manydisplay,csb);
		strcat(manydisplay,",VT");
		strcat(manydisplay,vi);
		strcat(manydisplay,"#");
		memset(updata, 0x00, 80);
		memcpy(updata, manydisplay, 80);
	}
	
}


void SendAutoUp(void)
{
	g_uptimes --;
	if ((g_autoup == 1) && (g_uptimes == 0))
	{
		CalcUpData();
		UART3_Send_Char(updata); 
	}
	if(g_uptimes == 0)
		 g_uptimes = 5000;

}

static float MotionClampFloat(float fValue, float fMin, float fMax)
{
	if(fValue > fMax)
	{
		return fMax;
	}
	if(fValue < fMin)
	{
		return fMin;
	}
	return fValue;
}

static void MotionTaskStartInternal(enMotionTaskType enType, float fSpeedCmd, float fTurnCmd, float fAccelStep, u16 u16DurationTick, u8 u8EnterTaskMode)
{
	fSpeedCmd = MotionClampFloat(fSpeedCmd, MOTION_SPEED_CMD_MIN, MOTION_SPEED_CMD_MAX);
	fTurnCmd = MotionClampFloat(fTurnCmd, MOTION_TURN_CMD_MIN, MOTION_TURN_CMD_MAX);

	if(fAccelStep < 0.0f)
	{
		fAccelStep = -fAccelStep;
	}
	fAccelStep = MotionClampFloat(fAccelStep, MOTION_ACCEL_STEP_MIN, MOTION_ACCEL_STEP_MAX);

	if(u16DurationTick < MOTION_TASK_DURATION_MIN_TICK)
	{
		u16DurationTick = MOTION_TASK_DURATION_MIN_TICK;
	}
	if(u16DurationTick > MOTION_TASK_DURATION_MAX_TICK)
	{
		u16DurationTick = MOTION_TASK_DURATION_MAX_TICK;
	}

	if(enType == enMotionTaskStraight)
	{
		fTurnCmd = 0.0f;
	}
	if(enType == enMotionTaskSpin)
	{
		fSpeedCmd = 0.0f;
	}

	g_stMotionTask.enType = enType;
	g_stMotionTask.fTargetSpeedCmd = fSpeedCmd;
	g_stMotionTask.fTargetTurnCmd = fTurnCmd;
	g_stMotionTask.fCurrentSpeedCmd = BST_fBluetoothSpeed;
	g_stMotionTask.fAccelStepPerTick = fAccelStep;
	g_stMotionTask.u16DurationTick = u16DurationTick;
	g_stMotionTask.u16ElapsedTick = 0;
	g_stMotionTask.u8Active = 1;

	if(u8EnterTaskMode != 0)
	{
		g_enAutoRunMode = enAutoRunTask;
		BST_u8MainEventLast = BST_u8MainEventCount;
	}
}

static u8 MotionTaskRunStep(u8 u8DeltaTick, float *pfSpeedCmd, float *pfTurnCmd)
{
	u8 u8Step;
	float fDeltaSpeed;

	if(g_stMotionTask.u8Active == 0)
	{
		*pfSpeedCmd = 0.0f;
		*pfTurnCmd = 0.0f;
		return 0;
	}

	for(u8Step = 0; u8Step < u8DeltaTick; u8Step++)
	{
		fDeltaSpeed = g_stMotionTask.fTargetSpeedCmd - g_stMotionTask.fCurrentSpeedCmd;
		if(fabsf(fDeltaSpeed) <= g_stMotionTask.fAccelStepPerTick)
		{
			g_stMotionTask.fCurrentSpeedCmd = g_stMotionTask.fTargetSpeedCmd;
		}
		else if(fDeltaSpeed > 0.0f)
		{
			g_stMotionTask.fCurrentSpeedCmd += g_stMotionTask.fAccelStepPerTick;
		}
		else
		{
			g_stMotionTask.fCurrentSpeedCmd -= g_stMotionTask.fAccelStepPerTick;
		}

		if(g_stMotionTask.u16ElapsedTick < g_stMotionTask.u16DurationTick)
		{
			g_stMotionTask.u16ElapsedTick++;
		}
		if(g_stMotionTask.u16ElapsedTick >= g_stMotionTask.u16DurationTick)
		{
			g_stMotionTask.u8Active = 0;
			break;
		}
	}

	*pfSpeedCmd = g_stMotionTask.fCurrentSpeedCmd;
	*pfTurnCmd = g_stMotionTask.fTargetTurnCmd;

	if(g_stMotionTask.u8Active == 0)
	{
		return 2;
	}
	return 1;
}

void MotionTask_SetStraight(float targetSpeedCmd, float accelStep, u16 durationTick)
{
	g_u8TaskStraightObsEnable = 0;
	MotionTaskStartInternal(enMotionTaskStraight, targetSpeedCmd, 0.0f, accelStep, durationTick, 1);
}

void MotionTask_SetStraightWithObs(float targetSpeedCmd, float accelStep, u16 durationTick, u8 obsEnable)
{
	g_u8TaskStraightObsEnable = (obsEnable == 0u) ? 0u : 1u;
	g_u8ObsConfirmCnt = 0;
	g_u8ObsStopConfirmCnt = 0;
	MotionTaskStartInternal(enMotionTaskStraight, targetSpeedCmd, 0.0f, accelStep, durationTick, 1);
}

void MotionTask_SetStraightObsAvoidEnable(u8 obsEnable)
{
	g_u8TaskStraightObsEnable = (obsEnable == 0u) ? 0u : 1u;
	g_u8ObsConfirmCnt = 0;
	g_u8ObsStopConfirmCnt = 0;
}

void MotionTask_SetArc(float speedCmd, float turnCmd, u16 durationTick)
{
	MotionTaskStartInternal(enMotionTaskArc, speedCmd, turnCmd, MOTION_DEFAULT_ACCEL_STEP, durationTick, 1);
}

void MotionTask_SetTurn(float speedCmd, float turnCmd, u16 durationTick)
{
	MotionTaskStartInternal(enMotionTaskTurn, speedCmd, turnCmd, MOTION_DEFAULT_ACCEL_STEP, durationTick, 1);
}

void MotionTask_SetSpin(float turnCmd, u16 durationTick)
{
	MotionTaskStartInternal(enMotionTaskSpin, 0.0f, turnCmd, MOTION_DEFAULT_ACCEL_STEP, durationTick, 1);
}

void MotionTask_Stop(void)
{
	g_stMotionTask.u8Active = 0;
	g_stMotionTask.enType = enMotionTaskIdle;
	g_stMotionTask.fTargetSpeedCmd = 0.0f;
	g_stMotionTask.fTargetTurnCmd = 0.0f;
	g_stMotionTask.fCurrentSpeedCmd = BST_fBluetoothSpeed;
	g_stMotionTask.u16ElapsedTick = 0;
}

void AutoRun_SetStraight(float speedCmd)
{
	g_enAutoRunMode = enAutoRunStraight;
	g_fStraightSpeedCmd = speedCmd;
	MotionTask_Stop();
	g_u8ObsConfirmCnt = 0;
	g_u8ObsStopConfirmCnt = 0;
	BST_u8MainEventLast = BST_u8MainEventCount;
	BST_u32EightTick = 0;
	BST_u8StraightEventLast = BST_u8MainEventCount;
}

void AutoRun_SetObsRightAvoid(float avoidSpeedCmd, float avoidTurnCmd)
{
	if(avoidSpeedCmd < 0.0f)
	{
		avoidSpeedCmd = -avoidSpeedCmd;
	}
	if(avoidTurnCmd < 0.0f)
	{
		avoidTurnCmd = -avoidTurnCmd;
	}
	g_fObsRightAvoidSpeedCmd = avoidSpeedCmd;
	g_fObsRightAvoidTurnCmd = avoidTurnCmd;
}

