TONYHUaNGggggg/Stm32_Balanced_Car/User/upstandingcar.c
void AutoRun_SetFigureEightArc(float arcSpeedCmd, float arcTurnCmd, u16 arcDurationTick, float accelStep, u8 startRightArc)
{
	arcSpeedCmd = fabsf(arcSpeedCmd);
	arcTurnCmd = fabsf(arcTurnCmd);

	g_stFigureEightParam.fBaseSpeedCmd = MotionClampFloat(arcSpeedCmd, 0.0f, MOTION_SPEED_CMD_MAX);
	g_stFigureEightParam.fTurnAmplCmd = MotionClampFloat(arcTurnCmd, 0.0f, MOTION_TURN_CMD_MAX);
	g_u16EightArcDurationTick = arcDurationTick;
	if(g_u16EightArcDurationTick < MOTION_TASK_DURATION_MIN_TICK)
	{
		g_u16EightArcDurationTick = MOTION_TASK_DURATION_MIN_TICK;
	}
	if(g_u16EightArcDurationTick > MOTION_TASK_DURATION_MAX_TICK)
	{
		g_u16EightArcDurationTick = MOTION_TASK_DURATION_MAX_TICK;
	}
	g_fEightArcAccelStep = MotionClampFloat(fabsf(accelStep), MOTION_ACCEL_STEP_MIN, MOTION_ACCEL_STEP_MAX);
	g_u8EightArcStartRight = (startRightArc == 0u) ? 0u : 1u;
	g_u8EightArcIndex = 0;

	g_stFigureEightParam.fOmegaRad = 6.2831853f / ((float)g_u16EightArcDurationTick * EIGHT_CTRL_DT_SEC);
	g_stFigureEightParam.fStartPhaseRad = (g_u8EightArcStartRight != 0u) ? 1.5707963f : -1.5707963f;
	g_stFigureEightParam.fSpeedModRatio = 0.0f;

	MotionTask_Stop();
	g_enAutoRunMode = enAutoRunFigureEight;
	BST_u8MainEventLast = BST_u8MainEventCount;
	BST_u32EightTick = 0;
}

void AutoRun_SetFigureEight(float baseSpeedCmd, float turnAmplCmd, float omegaRad, float startPhaseRad, float speedModRatio)
{
	float fArcTickFloat;
	u16 u16ArcTick;
	float fAccelStep;
	u8 u8StartRight;

	if(omegaRad < 0.10f)
	{
		omegaRad = 0.10f;
	}
	if(speedModRatio < 0.0f)
	{
		speedModRatio = 0.0f;
	}
	if(speedModRatio > 0.45f)
	{
		speedModRatio = 0.45f;
	}

	fArcTickFloat = (6.2831853f / omegaRad) / EIGHT_CTRL_DT_SEC;
	if(fArcTickFloat < (float)MOTION_TASK_DURATION_MIN_TICK)
	{
		fArcTickFloat = (float)MOTION_TASK_DURATION_MIN_TICK;
	}
	if(fArcTickFloat > (float)MOTION_TASK_DURATION_MAX_TICK)
	{
		fArcTickFloat = (float)MOTION_TASK_DURATION_MAX_TICK;
	}
	u16ArcTick = (u16)(fArcTickFloat + 0.5f);
	fAccelStep = MOTION_DEFAULT_ACCEL_STEP + speedModRatio * 1.2f;
	u8StartRight = ((float)sin(startPhaseRad) >= 0.0f) ? 1u : 0u;

	AutoRun_SetFigureEightArc(baseSpeedCmd, turnAmplCmd, u16ArcTick, fAccelStep, u8StartRight);
}

void AutoRun_SetFixed(float speedCmd, float turnCmd)
{
	g_enAutoRunMode = enAutoRunFixed;
	MotionTask_Stop();
	g_fFixedSpeedCmd = speedCmd;
	g_fFixedTurnCmd = turnCmd;
	BST_u8MainEventLast = BST_u8MainEventCount;
	BST_u32EightTick = 0;
}

static void StraightAvoidControl(void)
{
	float fSpeedCmd;
	float fDirectionCmd;

	fSpeedCmd = g_fStraightSpeedCmd;
	fDirectionCmd = 0.0f;
	MotionApplyObstacleAvoid(&fSpeedCmd, &fDirectionCmd);

	BST_fBluetoothSpeed = fSpeedCmd;
	BST_fBluetoothDirectionNew = fDirectionCmd;
	chaoflag = 0;
	fchaoshengbo = 0;
}

static void MotionApplyObstacleAvoid(float *pfSpeedCmd, float *pfDirectionCmd)
{
	float fDirectionLimit;
	float fObsSlowCm;
	float fObsCm;
	float fSpeedCmd;
	float fDirectionCmd;

	fSpeedCmd = *pfSpeedCmd;
	fDirectionCmd = *pfDirectionCmd;
	fObsSlowCm = ULTRA_OBS_SLOW_CM;
	if(fObsSlowCm <= (ULTRA_OBS_STOP_CM + 1.0f))
	{
		fObsSlowCm = ULTRA_OBS_STOP_CM + 8.0f;
	}
	fObsCm = juli;

	if(fObsCm >= ULTRA_OBS_VALID_MIN_CM && fObsCm <= ULTRA_OBS_STOP_CM)
	{
		g_u8ObsConfirmCnt = 0;
		if(g_u8ObsStopConfirmCnt < 255u)
		{
			g_u8ObsStopConfirmCnt++;
		}

		if(g_u8ObsStopConfirmCnt >= ULTRA_OBS_STOP_CONFIRM_CNT)
		{
			fSpeedCmd = 0.0f;
			fDirectionCmd = 0.0f;
		}
	}
	else if(fObsCm > ULTRA_OBS_STOP_CM && fObsCm <= fObsSlowCm)
	{
		g_u8ObsStopConfirmCnt = 0;
		if(g_u8ObsConfirmCnt < 255u)
		{
			g_u8ObsConfirmCnt++;
		}

		if(g_u8ObsConfirmCnt >= ULTRA_OBS_CONFIRM_CNT)
		{
			fSpeedCmd = g_fObsRightAvoidSpeedCmd;
			// 右避障转向幅度在此处生效。
			fDirectionCmd = g_fObsRightAvoidTurnCmd;
			fDirectionLimit = fabsf(fSpeedCmd) * ULTRA_OBS_RIGHT_TURN_SPEED_RATIO;
			if(fDirectionCmd > fDirectionLimit)
			{
				fDirectionCmd = fDirectionLimit;
			}
		}
	}
	else
	{
		g_u8ObsConfirmCnt = 0;
		g_u8ObsStopConfirmCnt = 0;
	}

	*pfSpeedCmd = fSpeedCmd;
	*pfDirectionCmd = fDirectionCmd;
}

static void FigureEightControl(void)
{
	u8 u8MainEventNow;
	u8 u8DeltaEvent;
	float fArcTurnCmd;
	float fSpeedCmd;
	float fTurnCmd;
	u8 u8RunState;

	u8MainEventNow = BST_u8MainEventCount;
	u8DeltaEvent = (u8)(u8MainEventNow - BST_u8MainEventLast);
	BST_u8MainEventLast = u8MainEventNow;

	if(g_stMotionTask.u8Active == 0u)
	{
		if((g_u8EightArcIndex & 0x01u) == 0u)
		{
			fArcTurnCmd = (g_u8EightArcStartRight != 0u) ? g_stFigureEightParam.fTurnAmplCmd : (-g_stFigureEightParam.fTurnAmplCmd);
		}
		else
		{
			fArcTurnCmd = (g_u8EightArcStartRight != 0u) ? (-g_stFigureEightParam.fTurnAmplCmd) : g_stFigureEightParam.fTurnAmplCmd;
		}

		MotionTaskStartInternal(
			enMotionTaskArc,
			g_stFigureEightParam.fBaseSpeedCmd,
			fArcTurnCmd,
			g_fEightArcAccelStep,
			g_u16EightArcDurationTick,
			0
		);
	}

	u8RunState = MotionTaskRunStep(u8DeltaEvent, &fSpeedCmd, &fTurnCmd);
	if(u8RunState == 2u)
	{
		g_u8EightArcIndex ^= 1u;
	}

	BST_fBluetoothSpeed = fSpeedCmd;
	BST_fBluetoothDirectionNew = fTurnCmd;
	chaoflag = 1;
	fchaoshengbo = 0;
}

static void MotionTaskControl(void)
{
	u8 u8MainEventNow;
	u8 u8DeltaEvent;
	float fSpeedCmd;
	float fTurnCmd;
	u8 u8RunState;

	u8MainEventNow = BST_u8MainEventCount;
	u8DeltaEvent = (u8)(u8MainEventNow - BST_u8MainEventLast);
	BST_u8MainEventLast = u8MainEventNow;

	u8RunState = MotionTaskRunStep(u8DeltaEvent, &fSpeedCmd, &fTurnCmd);
	if(u8RunState == 0u)
	{
		fSpeedCmd = 0.0f;
		fTurnCmd = 0.0f;
	}

	if(g_stMotionTask.enType == enMotionTaskStraight && g_u8TaskStraightObsEnable != 0u)
	{
		MotionApplyObstacleAvoid(&fSpeedCmd, &fTurnCmd);
	}
	else
	{
		g_u8ObsConfirmCnt = 0;
		g_u8ObsStopConfirmCnt = 0;
	}

	BST_fBluetoothSpeed = fSpeedCmd;
	BST_fBluetoothDirectionNew = fTurnCmd;
	chaoflag = 1;
	fchaoshengbo = 0;
}

void CarStateOut(void)
{
#if FIXED_SPEED_MODE
	switch (g_enAutoRunMode)
	{
		case enAutoRunFigureEight:
			FigureEightControl();
			break;

		case enAutoRunTask:
			MotionTaskControl();
			break;

		case enAutoRunFixed:
			BST_fBluetoothSpeed = g_fFixedSpeedCmd;
			BST_fBluetoothDirectionNew = g_fFixedTurnCmd;
			chaoflag = 1;
			fchaoshengbo = 0;
			break;

		case enAutoRunStraight:
		default:
			StraightAvoidControl();
			break;
	}
	return;
#endif

	switch (g_newcarstate)
	{
		case enSTOP: 
		{

			BST_fBluetoothSpeed = 0;
			fchaoshengbo=0;
			BST_fBluetoothDirectionNew=0;
			chaoflag=0;

		} break; 					   

		case enRUN: 
		{
			BST_fBluetoothDirectionNew= 0; 	
			
			BST_fBluetoothSpeed =  800 ;
			chaoflag=1;

		}break;	   

		case enLEFT:
		{

			BST_fBluetoothDirectionNew= -300; 
			chaoflag=1;

		}break;   
		
		case enRIGHT: 
		{

			BST_fBluetoothDirectionNew= 300; 
			chaoflag=1;

		}break;	
		
		case enBACK: 
		{
			BST_fBluetoothDirectionNew= 0; 
			
			BST_fBluetoothSpeed = (-800);
			chaoflag=1;  

		}break;
		
		case enTLEFT: 
		{
			BST_fBluetoothDirectionNew = -driectionxco; 
			chaoflag=1; 

		}break;
		case enTRIGHT: 
		{
			BST_fBluetoothDirectionNew = driectionxco; 
			chaoflag=1;
		}break;
		
		default: BST_fBluetoothSpeed = 0; break; 					   
	}
}

 
 
 
 
 
 
 
 
 
